#+TITLE: Understanding and Predicting Property Maintenance Fines

*** Stratified Dummy
#+BEGIN_SRC ipython :session blight :results output
cross_validation(DummyClassifier(strategy="stratified"))
#+END_SRC

#+RESULTS:
: Mean AUC: 0.49853940212149145 +- 0.01
: Median AUC: 0.4980127445355556

The stratified dummy does roughly the same as random chance.

*** Most Common Dummy
#+BEGIN_SRC ipython :session blight :results output
cross_validation(DummyClassifier(strategy="most_frequent"))
#+END_SRC

#+RESULTS:
: Mean AUC: 0.5 +- 0.00
: Median AUC: 0.5

The dummy using the 'most common' method does exactly the same as random chance.
*** Default
    First, let's see how the default random forest classifier does.

#+BEGIN_SRC ipython :session blight :results none
forest_base = RandomForestClassifier()
#+END_SRC

#+BEGIN_SRC ipython :session blight :results output
base_scores = cross_validation(forest_base)
#+END_SRC

#+RESULTS:
: Mean AUC: 0.7622999077332474 +- 0.01
: Median AUC: 0.7650908204018136

So, right out of the box it does better than required (assuming it holds up on the test-set).

#+BEGIN_SRC ipython :session blight :results none
forest_base.fit(x_train, y_train)
#+END_SRC

#+BEGIN_SRC ipython :session blight
len(dummies.testing_with_dummies)
#+END_SRC

#+RESULTS:
: 58797

#+BEGIN_SRC ipython :session blight :results none
predictions = forest_base.predict_proba(dummies.testing_with_dummies)
base_solution = pandas.DataFrame(predictions[:,1], index=dummies.testing_with_dummies.index)
#+END_SRC

*** Previous Optimal
    An earlier grid search I did showed that ~n_estimators=19~ and ~max_features=22~ did a little better. Let's see how it compares to the base random forest.

#+BEGIN_SRC ipython :session blight :results output
next_forest = RandomForestClassifier(n_estimators=19, max_features=22, n_jobs=4)
next_scores = cross_validation(next_forest)
#+END_SRC

#+RESULTS:
: Mean AUC: 0.7803765084583596 +- 0.02
: Median AUC: 0.7807684765859141

It looks like it does a little better.
*** Grid Search
   It says in the documentation that the square-root of the number of features has been found to be optimal for Random Forest classifiers and that more classifiers do better than fewer but at the expense of more computational cost. The grid-search lets you use multiple cores to run training in parallel. When I used -1 (all cores) it froze my computer so I'm going to use a little less.

#+BEGIN_SRC bash
cat /proc/cpuinfo | grep processor
#+END_SRC

#+RESULTS:
| processor | : 0 |
| processor | : 1 |
| processor | : 2 |
| processor | : 3 |
| processor | : 4 |
| processor | : 5 |
| processor | : 6 |
| processor | : 7 |

I've got 8 processors so I'll use four of them (I tried six and that froze the GUI too).

#+BEGIN_SRC ipython :session blight :results output
print(int(len(x_train.columns)**.5))
print(len(x_train.columns))
#+END_SRC

#+RESULTS:
: 21
: 469

#+BEGIN_SRC ipython :session blight :results none
sqrt_features = int(len(x_train.columns)**0.5)
cores = 6
param_grid = dict(n_estimators=range(10, 20, 5),
                  max_features=range(sqrt_features-2, sqrt_features+2, 2),)
forest = GridSearchCV(forest_base, param_grid, scoring="roc_auc", n_jobs=cores,
                      cv=10)

#+END_SRC

#+BEGIN_SRC ipython :session blight
forest.fit(x_train, y_train)
#+END_SRC

#+RESULTS:
#+begin_example
GridSearchCV(cv=10, error_score='raise',
       estimator=RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_split=1e-07, min_samples_leaf=1,
            min_samples_split=2, min_weight_fraction_leaf=0.0,
            n_estimators=10, n_jobs=1, oob_score=False, random_state=None,
            verbose=0, warm_start=False),
       fit_params={}, iid=True, n_jobs=4,
       param_grid={'n_estimators': range(10, 20), 'max_features': range(19, 23)},
       pre_dispatch='2*n_jobs', refit=True, return_train_score=True,
       scoring='roc_auc', verbose=0)
#+end_example

#+BEGIN_SRC ipython :session blight
forest.best_params_
#+END_SRC

#+RESULTS:
| max_features | : | 22 | n_estimators | : | 19 |

#+BEGIN_SRC ipython :session blight
forest.best_score_
#+END_SRC   

#+RESULTS:
: 0.7855610131289168

#+BEGIN_SRC ipython :session blight
forest.best_estimator_.predict_proba(dummies.testing_with_dummies)
#+END_SRC

#+RESULTS:
: array([[ 0.84210526,  0.15789474],
:        [ 1.        ,  0.        ],
:        [ 0.84210526,  0.15789474],
:        ..., 
:        [ 0.84210526,  0.15789474],
:        [ 0.84210526,  0.15789474],
:        [ 0.26315789,  0.73684211]])

